//Դուրս բերել 1-30 միայն զույգ թվերը։//

// for (let i = 2; i <= 30; i = i + 2) {
//   console.log(i);
// }

// Ցիկլի միջոցով հաշվել 1-1000 թվերի շարքում բոլոր այն թվերի ՔԱՆԱԿԸ որոնք,
// բաժանվում են  17 ի//

// for (let i = 1; i < 1000; i++) {
//   if (i % 17 == 0) {
//     console.log(i);
//   }
// }

//Ցիկլի միջոցով 1-50 թվերի շարքում դուրս բերել բոլոր թվերը, բացի
// նրանցից որոնք բաժանվում են 19 ի։//

// for (let i = 1; i < 50; i++) {
//   if (i % 19 !== 0) {
//     console.log(i);
//   }
// }

// 1-1000 թվերի շարքում դուրս բերել 7 -ի վրա բաժանվող 123-րդ թիվը://

// for (let i = 1; i < 1000; i++) {
//   if (i / 7 == 1) {
//     i = i * 123;
//     console.log(i);
//   }
// }

//Հաշվել 6-ի ֆակտորիալը։//

// let sum = 1;
// for (let i = 1; i <= 6; i++) {
//   sum = sum * i;
// }
// console.log(sum);
